In [ ]:
#agenda

In [1]:
import numpy as mm
import pandas as pd
from pandas import Series, DataFrame

In [4]:
#create dataFrame from clipboard
age_df = pd.read_clipboard()
print(age_df)

  First name    Last name  Age
0       Tinu     Elejogun   14
1      Marek  Kostrzewski   25
2       Lily    McGarrett   18
3  Olatunkbo     Chijiaku   22
4   Adrienne     Anthoula   22
5     Axelia   Athanasios   22
6  Jon-Kabat         Zinn   22
7    Thabang        Mosoa   15
8   Kgaogelo        Mosoa   11

In [5]:
#disply column names
age_df.columns

Index(['First name', 'Last name', 'Age'], dtype='object')

In [7]:
#Access one or more columns
age_df['First name']

0         Tinu
1        Marek
2         Lily
3    Olatunkbo
4     Adrienne
5       Axelia
6    Jon-Kabat
7      Thabang
8     Kgaogelo
Name: First name, dtype: object

In [8]:
age_df[['First name', 'Age']]

  First name  Age
0       Tinu   14
1      Marek   25
2       Lily   18
3  Olatunkbo   22
4   Adrienne   22
5     Axelia   22
6  Jon-Kabat   22
7    Thabang   15
8   Kgaogelo   11

In [10]:
# what is NaN value
age_df['rank'] = mm.nan
print(age_df)

  First name    Last name  Age  rank
0       Tinu     Elejogun   14   NaN
1      Marek  Kostrzewski   25   NaN
2       Lily    McGarrett   18   NaN
3  Olatunkbo     Chijiaku   22   NaN
4   Adrienne     Anthoula   22   NaN
5     Axelia   Athanasios   22   NaN
6  Jon-Kabat         Zinn   22   NaN
7    Thabang        Mosoa   15   NaN
8   Kgaogelo        Mosoa   11   NaN

In [12]:
#head and tail functions
age_df.head()

  First name    Last name  Age  rank
0       Tinu     Elejogun   14   NaN
1      Marek  Kostrzewski   25   NaN
2       Lily    McGarrett   18   NaN
3  Olatunkbo     Chijiaku   22   NaN
4   Adrienne     Anthoula   22   NaN

In [14]:
#tail functions

age_df.tail()

  First name   Last name  Age  rank
4   Adrienne    Anthoula   22   NaN
5     Axelia  Athanasios   22   NaN
6  Jon-Kabat        Zinn   22   NaN
7    Thabang       Mosoa   15   NaN
8   Kgaogelo       Mosoa   11   NaN

In [15]:
#assign values to a dataframe using 1 numpy 2. Series
array_1 = mm.arange(9)
print(age_df)

  First name    Last name  Age  rank
0       Tinu     Elejogun   14   NaN
1      Marek  Kostrzewski   25   NaN
2       Lily    McGarrett   18   NaN
3  Olatunkbo     Chijiaku   22   NaN
4   Adrienne     Anthoula   22   NaN
5     Axelia   Athanasios   22   NaN
6  Jon-Kabat         Zinn   22   NaN
7    Thabang        Mosoa   15   NaN
8   Kgaogelo        Mosoa   11   NaN

In [17]:
age_df['rank'] = array_1
print(age_df)

  First name    Last name  Age  rank
0       Tinu     Elejogun   14     0
1      Marek  Kostrzewski   25     1
2       Lily    McGarrett   18     2
3  Olatunkbo     Chijiaku   22     3
4   Adrienne     Anthoula   22     4
5     Axelia   Athanasios   22     5
6  Jon-Kabat         Zinn   22     6
7    Thabang        Mosoa   15     7
8   Kgaogelo        Mosoa   11     8

In [18]:
#2 Series
newRank_series = Series([10,11,12], index=[3,5,6])
age_df['rank'] = newRank_series
print(age_df)

  First name    Last name  Age  rank
0       Tinu     Elejogun   14   NaN
1      Marek  Kostrzewski   25   NaN
2       Lily    McGarrett   18   NaN
3  Olatunkbo     Chijiaku   22  10.0
4   Adrienne     Anthoula   22   NaN
5     Axelia   Athanasios   22  11.0
6  Jon-Kabat         Zinn   22  12.0
7    Thabang        Mosoa   15   NaN
8   Kgaogelo        Mosoa   11   NaN

In [19]:
#deleting a column
del(age_df['Last name'])
print(age_df)

  First name  Age  rank
0       Tinu   14   NaN
1      Marek   25   NaN
2       Lily   18   NaN
3  Olatunkbo   22  10.0
4   Adrienne   22   NaN
5     Axelia   22  11.0
6  Jon-Kabat   22  12.0
7    Thabang   15   NaN
8   Kgaogelo   11   NaN

In [20]:
#convert dictionary to s dataframe
sample_dict = {
    "company" : ['Nestle', 'PG'],
    'Profit' :[1000, 500]
}
print (sample_dict)

{'company': ['Nestle', 'PG'], 'Profit': [1000, 500]}

In [22]:
sample_df = DataFrame(sample_dict)
print(sample_df)

  company  Profit
0  Nestle    1000
1      PG     500